<?php

namespace App\Models;

class TradersQuotes
{
    public static $quotes = [
        [
            "author" => "Джесси Ливермор",
            "text" =>"«Я никогда не спорил с ценами. Можно обидеться на рынок, но пользы в этом никакой».",
        ],
        [
            "author" => "Морган Хаусел",
            "text" => "«Когда большинство людей говорят, что хотят стать миллионером, они на самом деле имеют ввиду «я хочу потратить миллион», что в прямом смысле означает как раз обратное».",
        ],
        [
            "author" => "Эд Сейкота",
            "text" => "«Рисковать следует не больше, чем можно себе позволить потерять, но одновременно достаточно для того, чтобы выигрыш получился существенным».",
        ],
        [
            "author" => "Даниэль Канеман",
            "text" => "«Продавцы считают, что цена слишком высока и вскоре упадет, а покупатели думают, что она чересчур низка и должна подняться. … В действительности уверенность большинства трейдеров – всего лишь иллюзия».",
        ],
        [
            "author" => "Джордж Сорос",
            "text" => "«Другие стыдятся ошибок, для меня же осознание собственных ошибок – источник гордости. Как только мы осознаем, что несовершенное понимание является одним из свойств человеческой природы, мы поймем, что не ошибаться стыдно, постыдна неспособность исправить собственные ошибки».",
        ],
        [
            "author" => "Александр Элдер",
            "text" => "«Рынок – как океан, его волны движутся вверх и вниз независимо от ваших желаний».",
        ],
        [
            "author" => "Ларри Вильямс",
            "text" => "«Всякий раз, когда моя жадность заставляла меня хватать быструю прибыль или пересиживать временной период, в котором я торгую, мне приходилось дорого платить за это».",
        ],
        [
            "author" => "Линда Рашке",
            "text" => "«Выберите один рынок или систему и изучите их вдоль и поперек, прежде чем расширять свое поле зрения. Не глядя на внутридневной график, записывайте цены каждые пять минут от открытия до закрытия. Делайте так в течение целой недели. Настройтесь на движение рынка. Где находятся уровни поддержки и сопротивления? Как ведет себя цена, когда достигает этих уровней? Что происходит во время последнего получаса торговли? Как долго продолжается каждое внутридневное движение цены? Вы не поверите, как много сможете узнать с помощью этого упражнения».",
        ],
        [
            "author" => "Марк Даглас",
            "text" => "«Постарайтесь усвоить один очень важный момент: новые знания о поведении рынка приобретаются постепенно, по мере того как вы будете все больше полагаться на себя».",
        ],
        [
            "author" => "Виктор Нидерхоффер",
            "text" => "«Разница между победой и поражением, как правило, висит на тонкой ниточке, и тот, кто готов отдать игре все, чего она требует, и немного больше, обладает потенциалом для величия».",
        ],
        [
            "author" => "Брюс Ковнер",
            "text" => "«Майкл Маркус – один из топ-трейдеров – научил меня одной простой и важной вещи: вы должны хотеть совершать ошибки регулярно, так как в этом нет ничего неправильного или постыдного. Майкл научил меня, что нужно принимать свои лучшие решения и суждения, ошибаться, принимать ещё одно прекрасное решение, ошибаться, находить третье лучшее суждение и принимать решение, которое удвоит ваш капитал».",
        ],
        [
            "author" => "Ренди Маккей",
            "text" => "«Когда я терплю поражение на рынке, то сразу же ухожу. И не важно, на каком рынке вы ведёте свой трейдинг. Я просто ухожу, потому что я верю в то, что если ты однажды проиграешь на рынке – все последующие решения будут гораздо менее объективными, чем они были при хорошем раскладе вещей… Если вы останетесь, когда рынок будет радикально настроен против вас, то рано или поздно он оставит вас ни с чем». ",
        ],
        [
            "author" => "Тони Салиба ",
            "text" => "«Я всегда определяю свои риски, поэтому мне не нужно о них волноваться».",
        ],
        [
            "author" => "Виктор Сперандео",
            "text" => "«Ключ к трейдинговому успеху – это эмоциональная дисциплина. Если бы ум был ключом, тогда многие трейдеры зарабатывали бы на торговле… Это будет звучать как клише, но единственная причина, по которой люди зарабатывают на финансовых рынках – это то, что они не урезают свои убытки».",
        ],
        [
            "author" => "Пол Тюдор Джонс",
            "text" => "«Если бы у меня были позиции, которые пошли бы против меня, то я бы избавился от них. Если бы позиции шли в мою пользу – я бы придержал их. Риск менеджмент – это самый главный нюанс в трейдинге. Если у вас есть проигрышная позиция, которая приносит вам дискомфорт – избавляйтесь от неё, чтобы у вас всегда была возможность вернуться».",
        ],
        [
            "author" => "Мартин Шварц",
            "text" => "«За прошедшие несколько лет на рынках я научился, что очень важно брать несколько дней отпуска. Естественное стремление – это играть, пока не получишь максимум выигрыша, но опыт научил, что отдых и свежий взгляд всегда могут расширить возможности».",
        ],
        [
            "author" => "Ренди Маккей",
            "text" => "«Я буду уменьшать размеры трейдинговых позиций до тех пор, пока я проигрываю… Мои техники мани менеджмента очень консервативны. Я никогда не рискую тем, что существенно повлияло бы на средства на моём счёте».",
        ],
        [
            "author" => "Джесси Ливермор",
            "text" => "«Если курс ведет себя не так, как должен бы, лучше эти акции не трогать. Ведь если ты не можешь знать, в чем там дело, то и не угадаешь, в каком направлении курс будет изменяться. Нет диагноза — нет и прогноза. Нет прогноза — нет и прибыли».",
        ],
        [
            "author" => "Эд Сейкота",
            "text" => "«От рынка каждый получает то, что желает: или прибыль, или убыток. Есть люди, которым нравится проигрывать, по этой причине, теряя деньги, они выигрывают».",
        ],
        [
            "author" => "Джордж Сорос",
            "text" => "«Начинайте с малого. Если дела пойдут, наращивайте большую позицию».",
        ],
        [
            "author" => "Эдвин Лефевр",
            "text" => "«Чтобы иметь деньги, нужно их делать. Чтобы делать большие деньги, нужно вовремя делать правильные вещи».",
        ],
        [
            "author" => "Ларри Вильямс",
            "text" => "«Импульс – одно из пяти понятий, которые могут приносить прибыль в краткосрочной торговле. Это то, что имел в виду Ньютон, сказавший, что объект, однажды приведенный в движение, стремится оставаться в движении».",
        ],
        [
            "author" => "Линда Рашке",
            "text" => "«Не жадничайте. Ничего страшного, если вы потеряете немного денег. Если вы не можете войти по благоприятной цене, забудьте об этой сделке и начинайте искать следующую».",
        ],
        [
            "author" => "Говард Сейдлер",
            "text" => "«Невозможно выиграть, если торгуете с таким левериджем, что вас пугает движение рынка».",
        ],
        [
            "author" => "Виктор Нидерхоффер",
            "text" => "«Подобно тому как верховные жрецы в донаучные времена использовали мифы, чтобы поддерживать социальный порядок и получать подношения от народа, сегодня профессионалы рыночных спекуляций используют наглые и простые мифы, чтобы получать вклады от доверчивых инвесторов».",
        ],
        [
            "author" => "Пол Тюдор Джонс",
            "text" => "«Я всегда думаю об убытках, а не о прибылях. Не фокусируйтесь на заработке – концентрируйтесь на защите своего капитала, который уже у вас есть».",
        ],
        [
            "author" => "Джордж Сорос",
            "text" => "«Рынки постоянно находятся в состоянии неопределённости и колебаний, а деньги зарабатываются путём расчётов очевидного и ставок не непредвиденное».",
        ],
        [
            "author" => "Марти Шварц",
            "text" => "«Я всегда смеюсь над людьми, которые говорят, что никогда не встречали богатого приверженца технического анализа. Вы слышали это? Высокомерное и бессмысленное утверждение. Я пользовался фундаментальным анализом в течение девяти лет, но по-настоящему разбогател только как технарь».",
        ],
        [
            "author" => "Марк Вайнштайн",
            "text" => "«Опыт и интуиция. Я использую все формы технического анализа, но пропускаю их через свою интуицию. Я не верю в математические системы, подход которых к рынку всегда одинаков. Используя в качестве “системы” себя, я постоянно изменяю входные параметры, чтобы получать тот же результат – прибыль».",
        ],
        [
            "author" => "Найел Фуллер",
            "text" => "«Не дайте одурачить себя современными шарлатанскими подходами к рынку. Для трейдера не существует легкого пути к заработку. Возможно, я – один из немногих преподавателей торговли, кто вам это скажет. Но это – правда. Самый “легкий” способ заработать деньги – изучить надежный и логичный метод торговли, который в основном или полностью полагается на чтение поведения цены на рынке, правильную психологию торговли и правильные практики управления капиталом».",
        ],
        [
            "author" => "Джим Роджерс",
            "text" => "«Я просто жду, пока в углу будут лежать деньги, и мне нужно будет только пойти и поднять их. До этого я ничего не делаю. Те люди, которые теряют на рынке деньги, говорят: “Я потерял деньги, теперь я должен сделать что-то, чтобы вернуть их”. Нет, не должны. Нужно просто сидеть, пока не найдете что-нибудь». ",
        ],
        [
            "author" => "Уильям Экхардт ",
            "text" => "«Я не заметил большой взаимосвязи между хорошей торговлей и интеллектом. Некоторые выдающиеся трейдеры довольно умны, а некоторые – нет. Многие невероятно интеллектуальные люди являются ужасными трейдерами. Достаточно среднего интеллекта. Гораздо важнее эмоциональная составляющая».",
        ],
        [
            "author" => "Найел Фуллер",
            "text" => "«Похоже, что многие люди не осознают, что именно их образ мышления в торговле мешает им зарабатывать на рынке. Вместо этого, они думают, что если просто найдут правильный индикатор или систему, то сразу же волшебным образом начнут печатать деньги прямо на своем компьютере. Успех в торговле является конечным результатом развития правильных привычек трейдера, а такие привычки появляются в результате обретения правильной психологии торговли».",
        ],
        [
            "author" => "Джесси Ливермор",
            "text" => "«Попытки понять, почему рынок изменился, всегда вызывают путаницу и эмоциональное расстройство. Дело в том, что рынок предваряет экономические новости, а не реагирует на них. Компания публикует хороший отчёт о прибылях, акция продолжает падать в цене. Почему? Да просто рынок уже учёл эти прибыли».",
        ],
        [
            "author" => "Пол Тудор Джоунс",
            "text" => "«Не старайтесь быть героем. Отбросьте самолюбие. Всегда сомневайтесь в себе и своих способностях. Не позволяйте себе почувствовать, что вы – очень хороши. В ту же секунду, как вы сделаете это, вы пропали. Мои самые большие потери всегда случались после великолепного периода, когда я начинал думать, что знаю секрет».",
        ],
        [
            "author" => "Эд Сейкота",
            "text" => "«Следование тренду является упражнением для наблюдения за текущим моментом и реагированием на него».",
        ],
        [
            "author" => "Билл Липшуц",
            "text" => "«При полосе неудач нужно напряженно работать, чтобы восстановить уверенность, а также сокращать размеры позиций».",
        ],
        [
            "author" => "Ларри Вильямс ",
            "text" => "«Хочешь хороших денег – умей выжидать».",
        ],
        [
            "author" => "Линда Рашке",
            "text" => "«Самый важный секрет — учитесь слушать рынки и не навязывать им свою волю».",
        ],
        [
            "author" => "Виктор Нидерхоффер",
            "text" => "«Очевидно, что саму жизнь можно рассматривать как серию спекуляций. И чтобы проводить эти спекуляции успешно, вы должны сбалансировать как минимум шесть переменных: первоначальный капитал, размер ставки, комиссионные, изменчивость самой игры, точку выхода из нее и ее продолжительность».",
        ],
        [
            "author" => "Брюс Ковнер",
            "text" => "«Всякий раз, когда я вхожу в позицию, я знаю, где стоит мой стоп. Только так я могу спать спокойно. Я знаю, где буду выходить, еще до того, как вхожу. Размер позиции в конкретной сделке определяется стоп-лоссом, а стоп-лосс определяется технически».",
        ],
        [
            "author" => "Эд Сейкота",
            "text" => "«Долгосрочное выживание и процветание на рынке во многом связаны с методами управления капиталом, используемыми в технической системе. Есть старые трейдеры и смелые трейдеры. Но очень мало старых смелых трейдеров».",
        ],
        [
            "author" => "Уильям Экхардт",
            "text" => "«Сделка или достаточно хороша, чтобы ее совершить (в этом случае в ней нужно участвовать полным размером позиции), или она вообще не стоит вашего беспокойства».",
        ],
        [
            "author" => "Марти Шварц",
            "text" => "«Научитесь принимать убытки. Самое важное в зарабатывании денег – не дать убыткам выйти из-под контроля. Поэтому не увеличивайте размер позиций, пока ваш капитал не вырастет в 2-3 раза. Большинство людей совершают ошибку, увеличивая ставки сразу же после того, как начинают зарабатывать. Это – быстрый путь к тому, чтобы быть выброшенным с рынка».",
        ],
        [
            "author" => "Стэнли Друкенмиллер",
            "text" => "«Я многому научился у Джорджа Сороса, но самое главное, наверное, что важно не то, правы вы или неправы, а то, сколько вы зарабатываете, когда правы, и сколько теряете, когда неправы».",
        ],
        [
            "author" => "Найел Фуллер",
            "text" => "«После того, как вы осознаете, что каждая сделка имеет равные шансы стать прибыльной или убыточной, вы перестанете придавать слишком большое эмоциональное и финансовое значение любой отдельно взятой сделке. Это откроет вам путь к беззаботной торговле и позволит обрести правильный психологический настрой».",
        ],
        [
            "author" => "Джесси Ливермор",
            "text" => "«Полагая, что прав, трейдер действует немедленно только для того, чтобы обнаружить, что после того, как он открыл позицию, акция идет в противоположную сторону».",
        ],
        [
            "author" => "Эд Сейкота",
            "text" => "«Чтобы не иметь убытков при «пилообразных» колебаниях цен, необходимо прекратить торговать».",
        ],
        [
            "author" => "Джордж Сорос",
            "text" => "«Деньги – только один из необходимых компонентов успеха, и при определенных обстоятельствах деньги могут принести больше вреда, чем пользы».",
        ],
        [
            "author" => "Дуг Касс",
            "text" => "«Небольшие убытки это часть игры. Большие убытки могут выбить вас из игры».",
        ],
        [
            "author" => "Ларри Вильямс",
            "text" => "«Богатые люди не делают больших ставок, и они не ставят каждый день».",
        ],
        [
            "author" => "Билл Вильямс",
            "text" => "«Рынок – не ваша проблема. Ваша проблема в том, что вы видите рынок в качестве вашей проблемы».",
        ],
        [
            "author" => "Линда Рашке",
            "text" => "«Каждый известный нам успешный трейдер познал необходимость в последовательности. В этом ключ ко всему — вы должны торговать, используя последовательную методологию. Вы должны следовать определенной стратегии торговли».",
        ],
        [
            "author" => "Бернард Барух",
            "text" => "«Биржевой спекулянт – человек, изучающий будущее и действующий до того, как оно наступит».",
        ],
        [
            "author" => "Эд Сейкота",
            "text" => "«Пока не изучена основная литература и не проведено определенное время около успешных трейдеров, можно считать, что торговля для начинающего трейдера ограничена пространством супермаркета».",
        ],
        [
            "author" => "Ларри Вильямс",
            "text" => "«Успех в торговле приходит от хорошего знания рынков и еще лучшего знания самих себя».",
        ],
        [
            "author" => "Джо Видич",
            "text" => "«Ограничьте размер своих позиций, чтобы страх не мог определять ваши суждения о рынке».",
        ],
        [
            "author" => "Джек Швагер ",
            "text" => "«В трейдинге не существует единственно правильного способа торговли, также не существует метода, который работал бы постоянно».",
        ],
        [
            "author" => "Билл Липшуц",
            "text" => "«Если бы большинство трейдеров научились сидеть сложа руки в течение 50 процентов времени, когда они торгуют, они бы заработали намного больше».",
        ],
        [
            "author" => "Майкл Карр ",
            "text" => "«Не беспокойтесь о том, что будет происходить на рынке. Лучше подумайте о том, что вы предпримите в ответ на действия рынка».",
        ],
        [
            "author" => "Пол Тюдор Джонс",
            "text" => "«Держите все под контролем и защищайте свою задницу. Не важно при этом, рискуете ли вы 10 000 или 100 миллионами долларов».",
        ],
        [
            "author" => "Джесси Ливермор",
            "text" => "«Дурак все время делает что-то не то. Дурак с Уолл-стрит считает, что должен постоянно торговать».",
        ],
        [
            "author" => "Джон Мейнард Кейнс ",
            "text" => "«Безопасней быть спекулянтом, чем инвестором в том смысле, что спекулянт берёт на себя те риски, которые знает, а инвестор – те риски, которые не знает».",
        ],
        [
            "author" => "Мартин Шварц",
            "text" => "«Я уже раньше говорил это, но скажу еще раз, потому что это очень важно: самым важным этапом в моей карьере трейдера стало понимание того, что нужно разделять эго и торговлю. Торговля – это психологическая игра. Большинство людей думают, что они играют против рынка, но рынку, на самом деле, все равно. Просто вы играете против самого себя. Перестаньте пытаться торговать только для того, чтобы доказать, что вы правы. Делайте только то, что рынок показывает в данный момент. Забудьте, что было 5 минут назад. Основа торговли заключается не в том, чтобы доказать себе, что ты прав, а в том чтобы заработать деньги».",
        ],
        [
            "author" => "Брэт Стинбаргер",
            "text" => "«На вопрос о том, как торговать прибыльно, вам не ответит ни книга, ни гуру, ни стратегия. Успех приходить со временем, если вы приложили для этого достаточно усилий».",
        ],
        [
            "author" => "Александр Элдер",
            "text" => "«Игроки терпят неудачу, когда они действуют без плана или уклоняются от выполнения своих планов. Планы создаются личностями путем рассуждений. Импульсивные сделки заключаются взбудораженными членами толпы».",
        ],
        [
            "author" => "Ричард Дрихаус",
            "text" => "«Вы должны открывать большую позицию, когда испытываете высокую степень уверенности, и держать такую позицию достаточно долго, чтобы реализовать большую часть потенциала. Последнее означает, что нужно избегать соблазна закрыть позицию, когда акция удвоится или утроится, если фундаментальные и технические условия по-прежнему указывают на продолжение роста цен. Но для этого надо иметь стальное терпение. И это именно то, что отличает магов рынка от менее опытных трейдеров».",
        ],
        [
            "author" => "Джил Блейк ",
            "text" => "«Изменились ли рынки? В микроскопическом смысле – да, в макроскопическом – нет. Меняются возможности, меняются стратегии, но люди и психология не меняются. Если не работает система следования за трендом, работает что-нибудь еще. Всегда кто-то теряет деньги и всегда кто-то выигрывает их».",
        ],
        [
            "author" => "Александр Элдер",
            "text" => "«Предаваться мечтам на бирже — роскошь непозволительная. Если сделки строятся на мечтах, лучше сразу употребить эти деньги на психотерапию».",
        ],
        [
            "author" => "Томас Демарк",
            "text" => "«Рынки не формируют дно из-за притока покупателей, они формируют дно, потому что больше нет продавцов».",
        ],
        [
            "author" => "Лари Хайт",
            "text" => "«Никогда не рискуйте больше чем 1% от ваших полных активов в любой сделке. Рискуя 1%, я безразличен к любой конкретной сделке. Постоянное сохранение своего риска на низком уровне является абсолютно необходимым».",
        ],
        [
            "author" => "Ричард Деннис ",
            "text" => "«Конечно же, я совершил несколько контр-трендовых сделок. Однако, как правило, я считаю, что торговля против тренда не является хорошей идеей».",
        ],
        [
            "author" => "Дэвид Теппер",
            "text" => "«Эта компания смотрится дешево, та компания смотрится дешево, но экономика целиком полностью меняет суть дела. Главное здесь – это ждать. Иногда тяжелее всего – это просто ничего не делать».",
        ],
        [
            "author" => "Льюис Бэйкон",
            "text" => "«Если вы спекулянт, то вам придется принять беспорядок и хаос».",
        ],
        [
            "author" => "Брюс Ковнер",
            "text" => "«Полагаю, что начинающие трейдеры торгуют в 3-5 раз больше, чем нужно. Новички берут на себя риски в 5-10% тогда, когда процент должен составлять всего 1-2%».",
        ],
    ];

    public static function count()
    {
        return count(self::$quotes);
    }

    public static function random()
    {
        return self::$quotes[rand(0, count(self::$quotes) - 1)];
    }
}
